99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_event_queue.c
#include "esp32_mquickjs_event_queue.h"

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_event_queue_drain.h"
#include "esp32_mquickjs_event_queue_resources.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_reaper.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_memory_rtos.h"

#include <stdatomic.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"

struct esp32_mquickjs_event_queue {
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_event_queue_resources_t resources;
    size_t event_size;
    uint32_t capacity;
    esp32_mquickjs_event_queue_overflow_t overflow;
    esp32_mquickjs_event_queue_to_js_fn to_js;
    esp32_mquickjs_event_queue_drop_fn drop;
    esp32_mquickjs_event_queue_close_fn close;
    esp32_mquickjs_event_queue_close_fn context_release;
    void *opaque;
    const char *memory_owner;
    portMUX_TYPE lock;
    esp32_mquickjs_future_token_t receiver;
    uint32_t dropped;
    uint32_t high_water;
    bool receiver_registered;
    bool dispose_requested;
    bool destroying;
    bool reaper_registered;
    bool reaper_hold;
    bool orphaned;
    uint32_t native_retain_count;
    _Atomic bool closed;
    struct esp32_mquickjs_event_queue *next;
};

typedef struct {
    esp32_mquickjs_event_queue_t *head;
    esp32_mquickjs_event_queue_t *orphans;
    bool reaper_registered;
} esp32_mquickjs_event_queue_runtime_t;

struct esp32_mquickjs_future_driver_state {
    esp32_mquickjs_event_queue_t *queue;
    JSContext *ctx;
    JSGCRef queue_ref;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    esp_timer_handle_t timer;
    void *event;
    uint32_t timeout_ms;
    bool received;
    bool event_finished;
    _Atomic bool timed_out;
    _Atomic bool completed;
    bool queue_retained;
    bool native_queue_retained;
};

static void *event_queue_allocate(esp32_mquickjs_event_queue_t *queue,
    size_t size, esp32_mquickjs_memory_budget_role_t role)
{
    return queue->memory_owner != NULL
        ? esp32_mquickjs_memory_wireless_calloc(queue->memory_owner, 1, size,
            ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, role)
        : heap_caps_calloc(1, size, MALLOC_CAP_8BIT);
}

static void *event_queue_resource_allocate(size_t bytes, void *opaque)
{
    return event_queue_allocate(opaque, bytes, ESP32_MQUICKJS_MEMORY_BUDGET_QUEUE);
}

static void event_queue_resource_release(void *allocation, void *opaque)
{
    esp32_mquickjs_event_queue_t *queue = opaque;
    if (queue->memory_owner != NULL) esp32_mquickjs_memory_payload_free(allocation);
    else heap_caps_free(allocation);
}

static void *event_queue_resource_create_lock(void *opaque)
{
    esp32_mquickjs_event_queue_t *queue = opaque;
    if (queue->memory_owner == NULL) return xSemaphoreCreateMutex();
    StaticSemaphore_t *storage = event_queue_resource_allocate(sizeof(*storage), opaque);
    if (storage == NULL) return NULL;
    SemaphoreHandle_t lock = xSemaphoreCreateMutexStatic(storage);
    if (lock == NULL) event_queue_resource_release(storage, opaque);
    return lock;
}

static void event_queue_resource_delete_lock(void *lock, void *opaque)
{
    vSemaphoreDelete((SemaphoreHandle_t)lock);
    esp32_mquickjs_event_queue_t *queue = opaque;
    if (queue->memory_owner != NULL) event_queue_resource_release(lock, opaque);
}

static void *event_queue_resource_create_queue(uint32_t capacity,
                                               size_t event_size,
                                               void *opaque)
{
    esp32_mquickjs_event_queue_t *queue = opaque;
    if (queue->memory_owner == NULL) return xQueueCreate(capacity, event_size);
    if (event_size > UINT32_MAX || event_size == 0 ||
        capacity > (SIZE_MAX - sizeof(StaticQueue_t)) / event_size) return NULL;
    StaticQueue_t *storage = event_queue_resource_allocate(
        sizeof(*storage) + (size_t)capacity * event_size, opaque);
    if (storage == NULL) return NULL;
    /* The pinned IDF returns the supplied StaticQueue_t as its native handle.
     * Its byte storage immediately follows the correctly aligned control. */
    QueueHandle_t events = xQueueCreateStatic(capacity, (UBaseType_t)event_size,
        (uint8_t *)(storage + 1), storage);
    if (events == NULL) event_queue_resource_release(storage, opaque);
    return events;
}

static void event_queue_resource_delete_queue(void *queue, void *opaque)
{
    vQueueDelete((QueueHandle_t)queue);
    esp32_mquickjs_event_queue_t *owner = opaque;
    if (owner->memory_owner != NULL) event_queue_resource_release(queue, opaque);
}

static const esp32_mquickjs_event_queue_resource_ops_t
    s_event_queue_resource_ops = {
        .allocate = event_queue_resource_allocate,
        .release = event_queue_resource_release,
        .create_lock = event_queue_resource_create_lock,
        .delete_lock = event_queue_resource_delete_lock,
        .create_queue = event_queue_resource_create_queue,
        .delete_queue = event_queue_resource_delete_queue,
    };

static esp32_mquickjs_event_queue_t *event_queue_from_value(JSContext *ctx,
                                                             JSValue value)
{
    if (JS_GetClassID(ctx, value) == JS_CLASS_EVENT_QUEUE) {
        return JS_GetOpaque(ctx, value);
    }
    if (JS_GetClassID(ctx, value) >= 0) {
        JSValue nested = JS_GetPropertyStr(ctx, value, "_eventQueue");

        if (!JS_IsException(nested) &&
            JS_GetClassID(ctx, nested) == JS_CLASS_EVENT_QUEUE) {
            return JS_GetOpaque(ctx, nested);
        }
    }
    return NULL;
}

static esp32_mquickjs_event_queue_runtime_t *event_queue_runtime(
    esp32_mquickjs_runtime_t *runtime)
{
    return runtime != NULL ? runtime->event_queue_state : NULL;
}

static void event_queue_register(esp32_mquickjs_event_queue_t *queue)
{
    esp32_mquickjs_event_queue_runtime_t *state;

    if (queue == NULL || (state = event_queue_runtime(queue->runtime)) == NULL) {
        return;
    }
    queue->next = state->head;
    state->head = queue;
}

