99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_event_queue.c
static void event_queue_unregister(esp32_mquickjs_event_queue_t *queue)
{
    esp32_mquickjs_event_queue_runtime_t *state;
    esp32_mquickjs_event_queue_t **cursor;

    if (queue == NULL || (state = event_queue_runtime(queue->runtime)) == NULL) {
        return;
    }
    cursor = &state->head;
    while (*cursor != NULL) {
        if (*cursor == queue) {
            *cursor = queue->next;
            queue->next = NULL;
            return;
        }
        cursor = &(*cursor)->next;
    }
}

static void event_queue_move_to_orphans(esp32_mquickjs_event_queue_t *queue)
{
    esp32_mquickjs_event_queue_runtime_t *state;

    if (queue == NULL || queue->orphaned ||
        (state = event_queue_runtime(queue->runtime)) == NULL) {
        return;
    }
    event_queue_unregister(queue);
    queue->next = state->orphans;
    state->orphans = queue;
    queue->orphaned = true;
}

static void event_queue_destroy_native(esp32_mquickjs_event_queue_t *queue)
{
    if (queue == NULL) {
        return;
    }
    esp32_mquickjs_event_queue_resources_deinit(
        &queue->resources, &s_event_queue_resource_ops, queue);
    esp32_mquickjs_event_queue_close_fn release = queue->context_release;
    void *opaque = queue->opaque;
    event_queue_resource_release(queue, queue);
    if (release != NULL) release(opaque);
}

static bool event_queue_take_destroy_ownership_locked(
    esp32_mquickjs_event_queue_t *queue)
{
    if (queue->dispose_requested && !queue->receiver_registered &&
        queue->native_retain_count == 0 && !queue->destroying) {
        queue->destroying = true;
        return true;
    }
    return false;
}

static bool event_queue_drain_receive(void *source, void *event);
static void event_queue_wake_receiver(esp32_mquickjs_event_queue_t *queue);

static bool event_queue_reap(void *opaque)
{
    esp32_mquickjs_event_queue_t *queue = opaque;
    esp32_mquickjs_event_queue_close_fn close;
    void *close_opaque;
    bool destroy = false;

    if (queue == NULL || queue->resources.send_lock == NULL ||
        xSemaphoreTake(
            (SemaphoreHandle_t)queue->resources.send_lock,
            pdMS_TO_TICKS(ESP32_MQUICKJS_REAPER_RETRY_MS)) != pdTRUE) {
        return false;
    }
    portENTER_CRITICAL(&queue->lock);
    close = queue->close;
    close_opaque = queue->opaque;
    queue->close = NULL;
    portEXIT_CRITICAL(&queue->lock);
    xSemaphoreGive((SemaphoreHandle_t)queue->resources.send_lock);

    if (close != NULL) {
        close(close_opaque);
    }

    if (queue->resources.events == NULL ||
        queue->resources.drain_scratch == NULL ||
        xSemaphoreTake(
            (SemaphoreHandle_t)queue->resources.send_lock,
            pdMS_TO_TICKS(ESP32_MQUICKJS_REAPER_RETRY_MS)) != pdTRUE) {
        return false;
    }
    (void)esp32_mquickjs_event_queue_drain(
        queue, queue->resources.drain_scratch,
        event_queue_drain_receive, queue->drop, queue->opaque);
    xSemaphoreGive((SemaphoreHandle_t)queue->resources.send_lock);

    portENTER_CRITICAL(&queue->lock);
    queue->reaper_registered = false;
    if (queue->reaper_hold) {
        queue->reaper_hold = false;
        queue->native_retain_count--;
    }
    destroy = event_queue_take_destroy_ownership_locked(queue);
    portEXIT_CRITICAL(&queue->lock);
    if (destroy) {
        event_queue_destroy_native(queue);
    }
    return true;
}

static bool event_queue_runtime_reap(void *opaque)
{
    esp32_mquickjs_event_queue_runtime_t *state = opaque;
    esp32_mquickjs_event_queue_t *queue;
    esp32_mquickjs_event_queue_t *next;
    esp32_mquickjs_event_queue_t **cursor;
    size_t attempted = 0;
    bool pending = false;

    if (state == NULL) {
        return true;
    }
    for (queue = state->head;
         queue != NULL && attempted < ESP32_MQUICKJS_REAPER_BATCH_LIMIT;
         queue = next) {
        next = queue->next;
        if (!queue->reaper_registered) {
            continue;
        }
        attempted++;
        (void)event_queue_reap(queue);
    }

    cursor = &state->orphans;
    while (*cursor != NULL &&
           attempted < ESP32_MQUICKJS_REAPER_BATCH_LIMIT) {
        queue = *cursor;
        next = queue->next;
        attempted++;
        if (event_queue_reap(queue)) {
            *cursor = next;
        } else {
            cursor = &queue->next;
        }
    }

    for (queue = state->head; queue != NULL; queue = queue->next) {
        if (queue->reaper_registered) {
            pending = true;
            break;
        }
    }
    if (state->orphans != NULL) {
        pending = true;
    }
    if (!pending) {
        state->reaper_registered = false;
    }
    return !pending;
}

static void event_queue_request_reap(esp32_mquickjs_event_queue_t *queue,
                                     bool dispose)
{
    esp32_mquickjs_event_queue_runtime_t *state;
    bool register_reaper = false;

    if (queue == NULL ||
        (state = event_queue_runtime(queue->runtime)) == NULL) {
        return;
    }
    if (dispose) {
        event_queue_move_to_orphans(queue);
    }
    atomic_store_explicit(&queue->closed, true, memory_order_release);
    portENTER_CRITICAL(&queue->lock);
    if (dispose) {
        queue->dispose_requested = true;
    }
    if (!queue->reaper_registered && !queue->destroying) {
        if (!queue->reaper_hold && queue->native_retain_count < UINT32_MAX) {
            queue->native_retain_count++;
            queue->reaper_hold = true;
        }
        if (queue->reaper_hold) {
            queue->reaper_registered = true;
        }
    }
    if (queue->reaper_registered && !state->reaper_registered) {
        state->reaper_registered = true;
        register_reaper = true;
    }
    portEXIT_CRITICAL(&queue->lock);

    if (register_reaper && !esp32_mquickjs_register_reserved_reaper(
            queue->runtime, ESP32_MQUICKJS_REAPER_RESERVED_EVENT_QUEUE,
            event_queue_runtime_reap, state)) {
        state->reaper_registered = false;
    }
    event_queue_wake_receiver(queue);
}

