99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_event_queue.c
static bool event_queue_drain_receive(void *source, void *event)
{
    esp32_mquickjs_event_queue_t *queue = source;
    portENTER_CRITICAL(&queue->lock);
    bool received = xQueueReceive((QueueHandle_t)queue->resources.events, event, 0) == pdTRUE;
    portEXIT_CRITICAL(&queue->lock);
    return received;
}

static uint32_t event_queue_sum(uint32_t left, uint32_t right)
{
    return right > UINT32_MAX - left ? UINT32_MAX : left + right;
}

static bool event_queue_enqueue_send(void *destination, const void *event)
{
    esp32_mquickjs_event_queue_t *queue = destination;
    /* This private RTOS queue has no blocking send/receive or queue-set users.
     * Zero-timeout calls cannot unblock an RTOS waiter/yield under this lock.
     * Serialize all mutations so a fast receiver cannot hide an enqueue peak.
     * Owned-event drop callbacks are always outside this critical section. */
    portENTER_CRITICAL(&queue->lock);
    bool sent = xQueueSend((QueueHandle_t)queue->resources.events, event, 0) == pdTRUE;
    uint32_t queued = (uint32_t)uxQueueMessagesWaitingFromISR((QueueHandle_t)queue->resources.events);
    if (queued > queue->high_water) queue->high_water = queued;
    portEXIT_CRITICAL(&queue->lock);
    return sent;
}

static bool event_queue_enqueue_send_from_isr(void *destination,
                                              const void *event,
                                              int *task_woken)
{
    esp32_mquickjs_event_queue_t *queue = destination;
    BaseType_t higher_priority_woken = pdFALSE;
    portENTER_CRITICAL_ISR(&queue->lock);
    bool sent = xQueueSendFromISR(
                    (QueueHandle_t)queue->resources.events, event,
                    &higher_priority_woken) == pdTRUE;
    uint32_t queued = (uint32_t)uxQueueMessagesWaitingFromISR((QueueHandle_t)queue->resources.events);
    if (queued > queue->high_water) queue->high_water = queued;
    portEXIT_CRITICAL_ISR(&queue->lock);

    if (task_woken != NULL && higher_priority_woken == pdTRUE) {
        *task_woken = 1;
    }
    return sent;
}

esp32_mquickjs_event_queue_t *esp32_mquickjs_event_queue_from_value(
    JSContext *ctx,
    JSValue value)
{
    return event_queue_from_value(ctx, value);
}

bool esp32_mquickjs_event_queue_bind_context_release(
    esp32_mquickjs_event_queue_t *queue,
    esp32_mquickjs_event_queue_close_fn release)
{
    if (queue == NULL || release == NULL) return false;
    portENTER_CRITICAL(&queue->lock);
    bool bound = queue->context_release == NULL && !queue->dispose_requested &&
        !queue->destroying && !queue->receiver_registered &&
        !atomic_load_explicit(&queue->closed, memory_order_acquire);
    if (bound) queue->context_release = release;
    portEXIT_CRITICAL(&queue->lock);
    return bound;
}

bool esp32_mquickjs_event_queue_retain(esp32_mquickjs_event_queue_t *queue)
{
    bool retained = false;

    if (queue == NULL) {
        return false;
    }
    portENTER_CRITICAL(&queue->lock);
    if (!queue->dispose_requested && !queue->destroying &&
        queue->native_retain_count < UINT32_MAX) {
        queue->native_retain_count++;
        retained = true;
    }
    portEXIT_CRITICAL(&queue->lock);
    return retained;
}

void esp32_mquickjs_event_queue_release(esp32_mquickjs_event_queue_t *queue)
{
    bool destroy = false;

    if (queue == NULL) {
        return;
    }
    portENTER_CRITICAL(&queue->lock);
    if (queue->native_retain_count > 0) {
        queue->native_retain_count--;
        destroy = event_queue_take_destroy_ownership_locked(queue);
    }
    portEXIT_CRITICAL(&queue->lock);
    if (destroy) {
        event_queue_destroy_native(queue);
    }
}

static void event_queue_wake_receiver(esp32_mquickjs_event_queue_t *queue)
{
    esp32_mquickjs_future_token_t token = {0};
    bool registered;

    portENTER_CRITICAL(&queue->lock);
    registered = queue->receiver_registered;
    token = queue->receiver;
    portEXIT_CRITICAL(&queue->lock);
    if (registered) {
        (void)esp32_mquickjs_future_wake(queue->runtime, token);
    }
    esp32_mquickjs_notify_activity(queue->runtime);
}

static bool event_queue_register_receiver(esp32_mquickjs_event_queue_t *queue,
                                          esp32_mquickjs_future_token_t token)
{
    bool registered = false;

    portENTER_CRITICAL(&queue->lock);
    if (!queue->receiver_registered) {
        queue->receiver_registered = true;
        queue->receiver = token;
        registered = true;
    }
    portEXIT_CRITICAL(&queue->lock);
    return registered;
}

static void event_queue_clear_receiver(esp32_mquickjs_event_queue_t *queue,
                                       esp32_mquickjs_future_token_t token)
{
    portENTER_CRITICAL(&queue->lock);
    if (queue->receiver_registered &&
        queue->receiver.slot == token.slot &&
        queue->receiver.generation == token.generation) {
        queue->receiver_registered = false;
        memset(&queue->receiver, 0, sizeof(queue->receiver));
    }
    portEXIT_CRITICAL(&queue->lock);
}

bool esp32_mquickjs_event_queue_send(esp32_mquickjs_event_queue_t *queue,
                                     const void *event)
{
    bool sent = false;
    uint32_t dropped = 0;

    if (queue == NULL || event == NULL || queue->resources.events == NULL ||
        queue->resources.send_lock == NULL ||
        atomic_load_explicit(&queue->closed, memory_order_acquire)) {
        return false;
    }
    if (xSemaphoreTake(
            (SemaphoreHandle_t)queue->resources.send_lock,
            portMAX_DELAY) != pdTRUE) {
        return false;
    }
    if (atomic_load_explicit(&queue->closed, memory_order_acquire)) {
        xSemaphoreGive((SemaphoreHandle_t)queue->resources.send_lock);
        return false;
    }
    sent = esp32_mquickjs_event_queue_enqueue(
        queue, event, queue->resources.overflow_scratch,
        queue->overflow == ESP32_MQUICKJS_EVENT_QUEUE_DROP_OLDEST,
        event_queue_enqueue_send, event_queue_drain_receive, queue->drop,
        queue->opaque, &dropped);
    if (dropped > 0) {
        portENTER_CRITICAL(&queue->lock);
        queue->dropped = event_queue_sum(queue->dropped, dropped);
        portEXIT_CRITICAL(&queue->lock);
    }
    if (!sent) {
        xSemaphoreGive((SemaphoreHandle_t)queue->resources.send_lock);
        return false;
    }
    xSemaphoreGive((SemaphoreHandle_t)queue->resources.send_lock);
    event_queue_wake_receiver(queue);
    return true;
}

bool esp32_mquickjs_event_queue_try_send_from_callback(
    esp32_mquickjs_event_queue_t *queue,
    const void *event)
{
    uint32_t dropped = 0;

