99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_event_queue.c
    if (queue == NULL || event == NULL || queue->resources.events == NULL ||
        queue->overflow != ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST ||
        atomic_load_explicit(&queue->closed, memory_order_acquire)) {
        return false;
    }
    if (!esp32_mquickjs_event_queue_enqueue_from_callback(
            queue, event, event_queue_enqueue_send,
            &dropped)) {
        if (dropped > 0) {
            portENTER_CRITICAL(&queue->lock);
            queue->dropped = event_queue_sum(queue->dropped, dropped);
            portEXIT_CRITICAL(&queue->lock);
        }
        return false;
    }
    event_queue_wake_receiver(queue);
    return true;
}

bool esp32_mquickjs_event_queue_try_receive(
    esp32_mquickjs_event_queue_t *queue,
    void *event)
{
    if (queue == NULL || event == NULL || queue->resources.events == NULL ||
        atomic_load_explicit(&queue->closed, memory_order_acquire)) {
        return false;
    }
    return event_queue_drain_receive(queue, event);
}

bool esp32_mquickjs_event_queue_send_from_isr(esp32_mquickjs_event_queue_t *queue,
                                              const void *event,
                                              int *task_woken)
{
    int higher_priority_woken = 0;
    uint32_t dropped = 0;
    esp32_mquickjs_future_token_t token = {0};
    bool registered;

    if (queue == NULL || event == NULL || queue->resources.events == NULL ||
        atomic_load_explicit(&queue->closed, memory_order_acquire)) {
        return false;
    }
    if (!esp32_mquickjs_event_queue_enqueue_from_isr(
            queue, event,
            event_queue_enqueue_send_from_isr,
            &higher_priority_woken, &dropped)) {
        portENTER_CRITICAL_ISR(&queue->lock);
        queue->dropped = event_queue_sum(queue->dropped, dropped);
        portEXIT_CRITICAL_ISR(&queue->lock);
        if (task_woken != NULL && higher_priority_woken != 0) {
            *task_woken = 1;
        }
        return false;
    }
    portENTER_CRITICAL_ISR(&queue->lock);
    registered = queue->receiver_registered;
    token = queue->receiver;
    portEXIT_CRITICAL_ISR(&queue->lock);
    if (registered) {
        int future_woken = 0;
        (void)esp32_mquickjs_future_wake_from_isr(queue->runtime, token, &future_woken);
        if (future_woken != 0) {
            higher_priority_woken = 1;
        }
    }
    if (task_woken != NULL && higher_priority_woken != 0) {
        *task_woken = 1;
    }
    return true;
}

bool esp32_mquickjs_event_queue_close(esp32_mquickjs_event_queue_t *queue)
{
    esp32_mquickjs_event_queue_close_fn close;
    void *opaque;

    if (queue == NULL || queue->resources.send_lock == NULL ||
        xSemaphoreTake((SemaphoreHandle_t)queue->resources.send_lock,
                       portMAX_DELAY) != pdTRUE) {
        return false;
    }
    portENTER_CRITICAL(&queue->lock);
    if (atomic_load_explicit(&queue->closed, memory_order_acquire)) {
        portEXIT_CRITICAL(&queue->lock);
        xSemaphoreGive((SemaphoreHandle_t)queue->resources.send_lock);
        return false;
    }
    atomic_store_explicit(&queue->closed, true, memory_order_release);
    close = queue->close;
    opaque = queue->opaque;
    queue->close = NULL;
    portEXIT_CRITICAL(&queue->lock);
    xSemaphoreGive((SemaphoreHandle_t)queue->resources.send_lock);
    if (close != NULL) {
        close(opaque);
    }
    event_queue_wake_receiver(queue);
    return true;
}

void esp32_mquickjs_event_queue_request_close(
    esp32_mquickjs_event_queue_t *queue)
{
    event_queue_request_reap(queue, false);
}

bool esp32_mquickjs_event_queue_dispose(JSContext *ctx, JSValue value)
{
    esp32_mquickjs_event_queue_t *queue;
    bool destroy;

    if (ctx == NULL || JS_GetClassID(ctx, value) != JS_CLASS_EVENT_QUEUE ||
        (queue = JS_GetOpaque(ctx, value)) == NULL) {
        return false;
    }
    JS_SetOpaque(ctx, value, NULL);
    event_queue_unregister(queue);
    (void)esp32_mquickjs_event_queue_close(queue);
    (void)esp32_mquickjs_event_queue_discard_all(queue);
    portENTER_CRITICAL(&queue->lock);
    queue->dispose_requested = true;
    destroy = event_queue_take_destroy_ownership_locked(queue);
    portEXIT_CRITICAL(&queue->lock);
    if (destroy) {
        event_queue_destroy_native(queue);
    }
    return true;
}

size_t esp32_mquickjs_event_queue_discard_all(
    esp32_mquickjs_event_queue_t *queue)
{
    size_t discarded;

    if (queue == NULL || queue->resources.events == NULL ||
        queue->resources.drain_scratch == NULL ||
        queue->resources.send_lock == NULL ||
        xSemaphoreTake((SemaphoreHandle_t)queue->resources.send_lock,
                       portMAX_DELAY) != pdTRUE) {
        return 0;
    }
    discarded = esp32_mquickjs_event_queue_drain(
        queue, queue->resources.drain_scratch,
        event_queue_drain_receive,
        queue->drop, queue->opaque);
    xSemaphoreGive((SemaphoreHandle_t)queue->resources.send_lock);
    return discarded;
}

bool esp32_mquickjs_event_queue_is_closed(const esp32_mquickjs_event_queue_t *queue)
{
    return queue == NULL || atomic_load_explicit(
                                &queue->closed, memory_order_acquire);
}

bool esp32_mquickjs_event_queue_get_stats(
    esp32_mquickjs_event_queue_t *queue,
    esp32_mquickjs_event_queue_stats_t *stats)
{
    if (queue == NULL || stats == NULL ||
        queue->resources.events == NULL) {
        return false;
    }
    memset(stats, 0, sizeof(*stats));
    stats->capacity = queue->capacity;
    portENTER_CRITICAL(&queue->lock);
    stats->queued = (uint32_t)uxQueueMessagesWaitingFromISR(
        (QueueHandle_t)queue->resources.events);
    stats->high_water = queue->high_water;
    stats->open = !atomic_load_explicit(&queue->closed,
                                        memory_order_acquire);
    stats->dropped = queue->dropped;
    stats->receiver_pending = queue->receiver_registered;
    portEXIT_CRITICAL(&queue->lock);
    return true;
}

uint32_t esp32_mquickjs_event_queue_dropped(esp32_mquickjs_event_queue_t *queue)
{
    uint32_t dropped = 0;

    if (queue == NULL) {
        return 0;
    }
    portENTER_CRITICAL(&queue->lock);
    dropped = queue->dropped;
    portEXIT_CRITICAL(&queue->lock);
    return dropped;
}

static void event_queue_timer_cb(void *arg)
{
    esp32_mquickjs_future_driver_state_t *state = arg;

    if (state == NULL || atomic_load_explicit(
                             &state->completed, memory_order_acquire)) {
        return;
    }
    atomic_store_explicit(&state->timed_out, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(state->runtime, state->token);
}

