99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_event_queue.c
static bool event_queue_future_prepare(JSContext *ctx,
                                       JSGCRef *this_ref,
                                       int argc,
                                       JSGCRef *argv,
                                       esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_event_queue_t *queue = event_queue_from_value(ctx, this_ref->val);
    esp32_mquickjs_future_driver_state_t *state;
    uint32_t timeout_ms = 0;

    if (queue == NULL || out_state == NULL || argc > 1 ||
        (argc == 1 && !esp32_mquickjs_value_to_bounded_u32(
            ctx, argv[0].val, 0, INT32_MAX, &timeout_ms))) {
        JS_ThrowTypeError(ctx, "EventQueue.receive(timeoutMs?) expects a non-negative timeout");
        return false;
    }
    state = event_queue_allocate(queue, sizeof(*state), ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->event = event_queue_allocate(queue, queue->event_size, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state->event == NULL) {
        event_queue_resource_release(state, queue);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    if (!esp32_mquickjs_event_queue_retain(queue)) {
        event_queue_resource_release(state->event, queue);
        event_queue_resource_release(state, queue);
        JS_ThrowInternalError(ctx, "EventQueue.receive() lost its queue");
        return false;
    }
    state->queue = queue;
    state->native_queue_retained = true;
    state->ctx = ctx;
    *JS_AddGCRef(ctx, &state->queue_ref) = this_ref->val;
    state->queue_retained = true;
    state->timeout_ms = argc == 1 ? timeout_ms : UINT32_MAX;
    atomic_init(&state->timed_out, false);
    atomic_init(&state->completed, false);
    *out_state = state;
    return true;
}

static bool event_queue_future_start(JSContext *ctx,
                                     esp32_mquickjs_runtime_t *runtime,
                                     esp32_mquickjs_future_token_t token,
                                     esp32_mquickjs_future_driver_state_t *state)
{
    esp_timer_create_args_t timer_args = {
        .callback = event_queue_timer_cb,
        .arg = state,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "mqjs_event_queue",
        .skip_unhandled_events = true,
    };

    if (state == NULL || state->queue == NULL) {
        JS_ThrowInternalError(ctx, "EventQueue.receive() lost its queue");
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    if (!event_queue_register_receiver(state->queue, token)) {
        JS_ThrowInternalError(ctx, "EventQueue.receive() already has a pending receiver");
        return false;
    }
    if (uxQueueMessagesWaiting(
            (QueueHandle_t)state->queue->resources.events) > 0 ||
        atomic_load_explicit(&state->queue->closed, memory_order_acquire)) {
        (void)esp32_mquickjs_future_wake(runtime, token);
        return true;
    }
    if (state->timeout_ms != UINT32_MAX) {
        if (state->timeout_ms == 0) {
            atomic_store_explicit(&state->timed_out, true,
                                  memory_order_release);
            (void)esp32_mquickjs_future_wake(runtime, token);
        } else if (esp_timer_create(&timer_args, &state->timer) != ESP_OK ||
                   esp_timer_start_once(state->timer,
                                        (uint64_t)state->timeout_ms * 1000ULL) != ESP_OK) {
            event_queue_clear_receiver(state->queue, token);
            if (state->timer != NULL) {
                esp_timer_delete(state->timer);
                state->timer = NULL;
            }
            JS_ThrowInternalError(ctx, "EventQueue.receive() failed to start timeout timer");
            return false;
        }
    }
    return true;
}

static esp32_mquickjs_future_poll_t event_queue_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || atomic_load_explicit(
                             &state->completed, memory_order_acquire)) {
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    if (event_queue_drain_receive(state->queue, state->event)) {
        state->received = true;
        atomic_store_explicit(&state->completed, true, memory_order_release);
    } else if (atomic_load_explicit(&state->timed_out, memory_order_acquire) ||
               atomic_load_explicit(&state->queue->closed,
                                    memory_order_acquire)) {
        atomic_store_explicit(&state->completed, true, memory_order_release);
    }
    if (atomic_load_explicit(&state->completed, memory_order_acquire)) {
        event_queue_clear_receiver(state->queue, state->token);
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    return ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue event_queue_future_finish(JSContext *ctx,
                                         esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || !state->received) {
        return JS_NULL;
    }
    state->event_finished = true;
    return state->queue->to_js(ctx, state->event, state->queue->opaque);
}

static esp32_mquickjs_cancel_result_t event_queue_future_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || atomic_load_explicit(
                             &state->completed, memory_order_acquire)) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
    event_queue_clear_receiver(state->queue, state->token);
    return ESP32_MQUICKJS_CANCELLED;
}

static void event_queue_future_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_event_queue_t *queue;
    bool release_queue;

    if (state == NULL) {
        return;
    }
    queue = state->queue;
    release_queue = state->native_queue_retained;
    if (state->received && !state->event_finished && queue != NULL &&
        queue->drop != NULL) {
        queue->drop(state->event, queue->opaque);
        state->event_finished = true;
    }
    if (state->timer != NULL) {
        (void)esp_timer_stop(state->timer);
        esp_timer_delete(state->timer);
    }
    if (state->queue_retained) {
        JS_DeleteGCRef(state->ctx, &state->queue_ref);
        state->queue_retained = false;
    }
    event_queue_resource_release(state->event, queue);
    event_queue_resource_release(state, queue);
    if (release_queue) {
        esp32_mquickjs_event_queue_release(queue);
    }
}

static const esp32_mquickjs_future_driver_t s_event_queue_future_driver = {
    .capture = event_queue_future_prepare,
    .start = event_queue_future_start,
    .poll = event_queue_future_poll,
    .finish = event_queue_future_finish,
    .cancel = event_queue_future_cancel,
    .destroy = event_queue_future_destroy,
};

bool esp32_mquickjs_event_queue_register_receive_alias(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime,
    JSValue function)
{
    return esp32_mquickjs_future_register_driver(
        ctx, runtime, function, &s_event_queue_future_driver);
}

bool esp32_mquickjs_init_event_queue_runtime(JSContext *ctx,
                                              esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_event_queue_runtime_t *state;
    JSGCRef object_ref;
    JSGCRef receive_ref;
    JSValue *object;
    JSValue *receive;
    bool result;

    if (runtime == NULL || runtime->event_queue_state != NULL) {
        return false;
    }
    state = esp32_mquickjs_memory_shared_runtime_owner() != NULL
        ? esp32_mquickjs_memory_wireless_calloc(esp32_mquickjs_memory_shared_runtime_owner(),
            1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL)
        : heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        return false;
    }
    runtime->event_queue_state = state;

    object = JS_PushGCRef(ctx, &object_ref);
    receive = JS_PushGCRef(ctx, &receive_ref);

