99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_event_queue.c
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_EVENT_QUEUE);
    *receive = JS_IsException(*object)
        ? JS_EXCEPTION
        : JS_GetPropertyStr(ctx, *object, "receive");
    result = !JS_IsException(*object) && !JS_IsException(*receive) &&
             esp32_mquickjs_event_queue_register_receive_alias(
                 ctx, runtime, *receive);
    if (!result && !JS_IsException(*object) && !JS_IsException(*receive)) {
        JS_ThrowInternalError(ctx, "failed to register EventQueue Future driver");
    }
    JS_PopGCRef(ctx, &receive_ref);
    JS_PopGCRef(ctx, &object_ref);
    if (!result) {
        esp32_mquickjs_deinit_event_queue_runtime(runtime);
    }
    return result;
}

void esp32_mquickjs_deinit_event_queue_runtime(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_event_queue_runtime_t *state = event_queue_runtime(runtime);
    esp32_mquickjs_event_queue_t *queue;
    esp32_mquickjs_event_queue_t *next;

    if (state == NULL) {
        return;
    }
    if (state->reaper_registered) {
        (void)esp32_mquickjs_unregister_reaper(
            runtime, event_queue_runtime_reap, state);
        state->reaper_registered = false;
    }
    while ((queue = state->head) != NULL) {
        state->head = queue->next;
        queue->next = state->orphans;
        state->orphans = queue;
        queue->orphaned = true;
        atomic_store_explicit(&queue->closed, true, memory_order_release);
        portENTER_CRITICAL(&queue->lock);
        queue->dispose_requested = true;
        if (!queue->reaper_hold) {
            queue->native_retain_count++;
            queue->reaper_hold = true;
        }
        queue->reaper_registered = true;
        portEXIT_CRITICAL(&queue->lock);
    }
    for (queue = state->orphans; queue != NULL; queue = next) {
        next = queue->next;
        while (!event_queue_reap(queue)) {
            vTaskDelay(1);
        }
    }
    state->orphans = NULL;
    esp32_mquickjs_memory_payload_free(state);
    runtime->event_queue_state = NULL;
}

bool esp32_mquickjs_get_event_queue_status(
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_event_queue_status_t *status)
{
    esp32_mquickjs_event_queue_runtime_t *state = event_queue_runtime(runtime);
    esp32_mquickjs_event_queue_t *queue;

    if (status == NULL) {
        return false;
    }
    memset(status, 0, sizeof(*status));
    if (state == NULL) {
        return true;
    }
    for (queue = state->head; queue != NULL; queue = queue->next) {
        esp32_mquickjs_event_queue_stats_t stats;
        if (!esp32_mquickjs_event_queue_get_stats(queue, &stats)) continue;
        status->dropped = event_queue_sum(status->dropped, stats.dropped);
        status->queued = event_queue_sum(status->queued, stats.queued);
        status->capacity = event_queue_sum(status->capacity, stats.capacity);
        status->high_water = event_queue_sum(status->high_water, stats.high_water);
        if (stats.open) status->open = event_queue_sum(status->open, 1);
    }
    return true;
}

void esp32_mquickjs_reset_event_queue_counters(esp32_mquickjs_runtime_t *runtime)
{
    esp32_mquickjs_event_queue_runtime_t *state = event_queue_runtime(runtime);
    if (state == NULL) return;
    for (esp32_mquickjs_event_queue_t *queue = state->head; queue != NULL; queue = queue->next) {
        portENTER_CRITICAL(&queue->lock);
        queue->dropped = 0;
        queue->high_water = queue->resources.events == NULL ? 0 :
            (uint32_t)uxQueueMessagesWaitingFromISR((QueueHandle_t)queue->resources.events);
        portEXIT_CRITICAL(&queue->lock);
    }
}

static JSValue event_queue_new(const char *memory_owner, JSContext *ctx,
                                       esp32_mquickjs_runtime_t *runtime,
                                       size_t event_size,
                                       uint32_t capacity,
                                       esp32_mquickjs_event_queue_overflow_t overflow,
                                       esp32_mquickjs_event_queue_to_js_fn to_js,
                                       esp32_mquickjs_event_queue_drop_fn drop,
                                       esp32_mquickjs_event_queue_close_fn close,
                                       void *opaque)
{
    esp32_mquickjs_event_queue_t *queue;
    JSValue object;

    if (ctx == NULL || runtime == NULL || event_size == 0 || capacity == 0 || to_js == NULL) {
        return JS_ThrowInternalError(ctx, "invalid native EventQueue configuration");
    }
    if (event_size > UINT32_MAX || capacity > (SIZE_MAX - sizeof(StaticQueue_t)) / event_size)
        return JS_ThrowRangeError(ctx, "native EventQueue storage size overflow");
    queue = memory_owner != NULL
        ? esp32_mquickjs_memory_wireless_calloc(memory_owner, 1, sizeof(*queue),
            ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL, ESP32_MQUICKJS_MEMORY_BUDGET_QUEUE)
        : heap_caps_calloc(1, sizeof(*queue), MALLOC_CAP_8BIT);
    if (queue == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    queue->memory_owner = memory_owner;
    if (!esp32_mquickjs_event_queue_resources_init(
            &queue->resources, event_size, capacity,
            overflow == ESP32_MQUICKJS_EVENT_QUEUE_DROP_OLDEST,
            &s_event_queue_resource_ops, queue)) {
        event_queue_resource_release(queue, queue);
        return JS_ThrowOutOfMemory(ctx);
    }
    queue->runtime = runtime;
    queue->event_size = event_size;
    queue->capacity = capacity;
    queue->overflow = overflow;
    queue->to_js = to_js;
    queue->drop = drop;
    queue->close = close;
    queue->opaque = opaque;
    queue->lock = (portMUX_TYPE)portMUX_INITIALIZER_UNLOCKED;
    atomic_init(&queue->closed, false);
    object = JS_NewObjectClassUser(ctx, JS_CLASS_EVENT_QUEUE);
    if (JS_IsException(object)) {
        esp32_mquickjs_event_queue_resources_deinit(
            &queue->resources, &s_event_queue_resource_ops, queue);
        event_queue_resource_release(queue, queue);
        return object;
    }
    JS_SetOpaque(ctx, object, queue);
    event_queue_register(queue);
    return object;
}

JSValue esp32_mquickjs_event_queue_new(JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    size_t event_size, uint32_t capacity, esp32_mquickjs_event_queue_overflow_t overflow,
    esp32_mquickjs_event_queue_to_js_fn to_js, esp32_mquickjs_event_queue_drop_fn drop,
    esp32_mquickjs_event_queue_close_fn close, void *opaque)
{
    return event_queue_new(NULL, ctx, runtime, event_size, capacity, overflow, to_js, drop, close, opaque);
}

JSValue esp32_mquickjs_event_queue_new_wireless(const char *owner, JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime, size_t event_size, uint32_t capacity,
    esp32_mquickjs_event_queue_overflow_t overflow,
    esp32_mquickjs_event_queue_to_js_fn to_js, esp32_mquickjs_event_queue_drop_fn drop,
    esp32_mquickjs_event_queue_close_fn close, void *opaque)
{
    if (owner == NULL || owner[0] == '\0')
        return JS_ThrowInternalError(ctx, "wireless EventQueue requires a memory owner");
    return event_queue_new(owner, ctx, runtime, event_size, capacity, overflow, to_js, drop, close, opaque);
}

JSValue js_event_queue_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "EventQueue cannot be constructed directly");
}

void js_event_queue_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_event_queue_t *queue = opaque;

    (void)ctx;
    if (queue == NULL) {
        return;
    }
    event_queue_request_reap(queue, true);
}

JSValue js_event_queue_receive(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef receive_ref;
    JSValue *receive = JS_PushGCRef(ctx, &receive_ref);
    JSValue result;

    if (this_val == NULL || event_queue_from_value(ctx, *this_val) == NULL) {
        JS_PopGCRef(ctx, &receive_ref);
        return JS_ThrowTypeError(ctx, "EventQueue.receive() called on an incompatible receiver");
    }
    *receive = JS_GetPropertyStr(ctx, *this_val, "receive");
    result = JS_IsException(*receive)
        ? JS_EXCEPTION
        : esp32_mquickjs_future_call_and_wait(ctx,
                                               esp32_mquickjs_get_active_runtime(),
                                               *receive,
                                               *this_val,
                                               argc,
                                               argv);
    JS_PopGCRef(ctx, &receive_ref);
    return result;
}

