99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_event_queue.c
JSValue js_event_queue_stats(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    esp32_mquickjs_event_queue_t *queue;
    esp32_mquickjs_event_queue_stats_t stats;
    JSGCRef object_ref;
    JSValue *object;

    (void)argc;
    (void)argv;
    if (this_val == NULL ||
        (queue = event_queue_from_value(ctx, *this_val)) == NULL) {
        return JS_ThrowTypeError(
            ctx, "EventQueue.stats() called on an incompatible receiver");
    }
    if (!esp32_mquickjs_event_queue_get_stats(queue, &stats)) {
        return JS_ThrowInternalError(ctx, "EventQueue stats are unavailable");
    }
    object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "open",
                                         JS_NewBool(stats.open)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "queued",
                                         JS_NewUint32(ctx, stats.queued)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "capacity",
                                         JS_NewUint32(ctx, stats.capacity)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "dropped",
                                         JS_NewUint32(ctx, stats.dropped)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "highWater",
                                         JS_NewUint32(ctx, stats.high_water)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "receiverPending",
                                         JS_NewBool(stats.receiver_pending))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_event_queue_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_event_queue_t *queue;

    (void)argc;
    (void)argv;
    if (this_val == NULL || (queue = event_queue_from_value(ctx, *this_val)) == NULL) {
        return JS_ThrowTypeError(ctx, "EventQueue.close() called on an incompatible receiver");
    }
    return JS_NewBool(esp32_mquickjs_event_queue_close(queue));
}
